/*
 Теорія:
  • Struct vs Class — у чому різниця, коли що краще використовувати
  • Ініціалізатори (init), властивості, методи
  • Наслідування класів, ключові слова super і override
  • Protocol: що це таке, навіщо потрібен, як змушує дотримуватись правил
  • Enum: raw values, associated values
  • Extension: як “дописати” нову поведінку до вже існуючого типу

 Практика:
  • Створити гілку Lesson3 у GitHub
  • У проекті створити файл Lesson3.swift і виконати наступне
  1. Створити enum FuelType, який має три значення: petrol, diesel, electric
  • Додати метод або var description: String, що повертає текстовий опис типу палива
  2. Створити протокол Vehicle, який описує загальні властивості та поведінку транспортного засобу:
  • бренд
  • тип пального
  • кількість колес
  • пробіг
  • функція "їхати" (з параметром кілометрів)
  3. Створити клас Car, який реалізує протокол Vehicle
  • Ініціалізатор, який приймає brand і fuelType
  • Реалізація методу drive(kilometers:):
  • додає кілометри до mileage
  • друкує повідомлення залежно від типу палива:
  • якщо petrol — "турбінка дує (brand) чимчикує"
  • якщо diesel — "помалу-потрохи але їдемо"
  • якщо electric — "вжух, тихо і економно"
  4. Створити клас Motorcycle, який також реалізує протокол Vehicle
  • Ініціалізатор аналогічний до Car
  • Реалізація методу drive(kilometers:) - так само, але друкувати "пролітаю між заторів"
  5. Створити масив із 10 транспортних засобів (частина — автомобілі, частина — мотоцикли)
  • Для кожного викликати drive(kilometers:) від 1 до 5 разів (рандомно) з випадковим числом (0–500 км)
  • Після кожної поїздки друкувати пробіг і повідомлення
  6. Підрахувати і надрукувати статистику:\
  • Кількість транспортних засобів
  • Кількість автомобілів і мотоциклів
  • Кількість кожного типу палива
  •  • Середній пробіг усіх транспортних засобів
*/


class ViewLesson3 {
	static let shared = ViewLesson3()
	
	let vehiclesList: [String] = [
		"Toyota Camry",
		"Honda Civic",
		"Harley-Davidson Fat Boy",
		"BMW X5",
		"Kawasaki Ninja 400",
		"Ford F-150",
		"Ducati Panigale V4",
		"Tesla Model 3",
		"Yamaha MT-07",
		"Mercedes C-Class"
	]

	func vehicleSimulation() {
		print("Lesson 3")
	}
}
