/*
 2й тиждень:

 Теорія:
 - Array, Dictionary, Set, у чому відмінності, де застосовується і де зберігається у памʼяті
 - Reference type vs Value type / heap vs stack (почитати теорію, а потім розказати мені)
 - Оператори циклу: for, while, forEach
 - Задачка з зірочкою: числа Фібоначчі

 Практика:
 - Для цього ж проекту створити гілку Lesson2 на GitHub
 - У проекті створити класс Lesson2 (або що завгодно, що буде виконуватись) і зробити наступні дії:

 - Уявляємо, що Dictionary - це щоденник школяра, у якому ключами (key) будуть назви предметів, а значеннями (value) - оцінки за цей предмет. Нехай буде 5-7 предметів, з максимальною оцінкою 12 (як у школі).
 - Створити 20 щоденників школярів з випадковими оцінками за предмети:
	- Спочатку можеш зробити це «ручками», набити памʼять, як це працює
	- Потім створити їх за допомогою оператору циклу (for)
 - Роздрукувати у консоль ці 20 словників, але за допомогою оператору forEach
 - Разом із цим, роздрукувати для кожного учня середній бал за усі предмети
 - І врешті решт, роздрукувати загальний середній бал класу, щоб зрозуміти, чи отримає класний керівник грамоту від РАЙОНО (я не знаю, що це, та мені запало це слово у душу)
 - Якщо середній бал вище 8 - напиши в консоль «Ще поживемо», якщо нижче «Спробуємо ще наступного року»

 - Задачка із зірочкою: роздрукувати у консоль перші N чисел Фібоначчі:
	 - за допомогою циклу
	 - за допомогою рекурсії (почитати, що це таке)
*/

class ViewLesson2 {
	static let shared = ViewLesson2()
	
	func studentAndClassResults() {
		let listSubjects = ["Алгебра", "Геометрія", "Фізика", "Історія", "Українська мова", "Українська література", "Англійська мова"]
		let listStudent = ["Антон", "Аліна", "Василь", "Вікторія", "Богдан", "Дарина", "Єгор", "Саша", "Женя", "Яна", "Максим", "Олена", "Олег", "Поліна", "Рома", "Софія", "Коля", "Маша", "Андрій", "Христина"]
		var resultOneStudent: [String: Int] = [:]
		var dictionaryLearningOutcomes: [String: [String: Int]] = [:]
		
		for itemSubjects in listSubjects {
			let randomAssessment = Int.random(in: 1...12)
			resultOneStudent[itemSubjects] = randomAssessment
		}
		
		for studentResults in listStudent {
			dictionaryLearningOutcomes[studentResults] = resultOneStudent
		}
		
		print(dictionaryLearningOutcomes)

//		let dictionaryLearningOutcomes = ["1Учень - Антон": ["Алгебра": 10, "Геометрія": 11, "Фізика": 5, "Історія": 9, "Українська мова": 10, "Українська література": 10, "Англійська мова": 8],
//										  "2Учень - Аліна": ["Алгебра": 4, "Геометрія": 4, "Фізика": 5, "Історія": 11, "Українська мова": 12, "Українська література": 10, "Англійська мова": 9],
//										  "3Учень - Василь": ["Алгебра": 12, "Геометрія": 12, "Фізика": 12, "Історія": 6, "Українська мова": 7, "Українська література": 6, "Англійська мова": 8],
//										  "4Учень - Вікторія": ["Алгебра": 10, "Геометрія": 11, "Фізика": 8, "Історія": 10, "Українська мова": 10, "Українська література": 11, "Англійська мова": 8],
//										  "5Учень - Богдан": ["Алгебра": 9, "Геометрія": 9, "Фізика": 7, "Історія": 11, "Українська мова": 8, "Українська література": 9, "Англійська мова": 10],
//										  "6Учень - Дарина": ["Алгебра": 11, "Геометрія": 10, "Фізика": 10, "Історія": 8, "Українська мова": 11, "Українська література": 12, "Англійська мова": 11],
//										  "7Учень - Єгор": ["Алгебра": 3, "Геометрія": 3, "Фізика": 2, "Історія": 5, "Українська мова": 3, "Українська література": 4, "Англійська мова": 2],
//										  "8Учень - Саша": ["Алгебра": 12, "Геометрія": 11, "Фізика": 10, "Історія": 12, "Українська мова": 11, "Українська література": 10, "Англійська мова": 9],
//										  "9Учень - Женя": ["Алгебра": 5, "Геометрія": 7, "Фізика": 6, "Історія": 5, "Українська мова": 8, "Українська література": 7, "Англійська мова": 6],
//										  "10Учень - Яна": ["Алгебра": 10, "Геометрія": 12, "Фізика": 11, "Історія": 10, "Українська мова": 10, "Українська література": 11, "Англійська мова": 12],
//										  "11Учень - Максим": ["Алгебра": 8, "Геометрія": 8, "Фізика": 9, "Історія": 7, "Українська мова": 9, "Українська література": 8, "Англійська мова": 10],
//										  "12Учень - Олена": ["Алгебра": 11, "Геометрія": 11, "Фізика": 12, "Історія": 9, "Українська мова": 10, "Українська література": 11, "Англійська мова": 10],
//										  "13Учень - Олег": ["Алгебра": 6, "Геометрія": 5, "Фізика": 7, "Історія": 4, "Українська мова": 6, "Українська література": 5, "Англійська мова": 7],
//										  "14Учень - Поліна": ["Алгебра": 12, "Геометрія": 11, "Фізика": 10, "Історія": 11, "Українська мова": 12, "Українська література": 12, "Англійська мова": 11],
//										  "15Учень - Рома": ["Алгебра": 9, "Геометрія": 10, "Фізика": 9, "Історія": 9, "Українська мова": 8, "Українська література": 8, "Англійська мова": 9],
//										  "16Учень - Софія": ["Алгебра": 7, "Геометрія": 8, "Фізика": 8, "Історія": 10, "Українська мова": 11, "Українська література": 10, "Англійська мова": 9],
//										  "17Учень - Коля": ["Алгебра": 4, "Геометрія": 1, "Фізика": 2, "Історія": 5, "Українська мова": 5, "Українська література": 7, "Англійська мова": 3],
//										  "18Учень - Маша": ["Алгебра": 11, "Геометрія": 12, "Фізика": 11, "Історія": 10, "Українська мова": 11, "Українська література": 10, "Англійська мова": 12],
//										  "19Учень - Андрій": ["Алгебра": 8, "Геометрія": 7, "Фізика": 6, "Історія": 9, "Українська мова": 8, "Українська література": 9, "Англійська мова": 7],
//										  "20Учень - Христина": ["Алгебра": 10, "Геометрія": 10, "Фізика": 10, "Історія": 10, "Українська мова": 10, "Українська література": 10, "Англійська мова": 10]
//		]
		
//		dictionaryLearningOutcomes.forEach { dictionaryItem in
//			print(dictionaryItem)
//		}
	}
}
