/*4й тиждень

Ну що ж, цього тижня закругляємось з "базою" і будемо переходити до більш реальних задач, які можуть спіткати тебе на роботі, а ось завдання на наступний тиждень:

Теорія:
 • Методи сортування із книги "Грокаєм алгоритми", що таке "складність"
 • Optional: що це, навіщо потрібен, як безпечно розпаковувати (if let, guard let, ??, !)
 • Closures: що це таке, як виглядає синтаксис, передача замикань у функції
 • Модифікатори доступу: private, fileprivate, internal, public, open — коли який використовувати
 • lazy properties та computed properties
 • Параметр inout

Практика:
 • Створити гілку Lesson4 у GitHub
 • У проекті створити файл Lesson4.swift
 • Для цього завдання також використаємо протоколи/класи із попереднього завдання

 1. Уявімо, що ми розвиваємо автопарк майбутнього.
Створи структуру Driver, у якій є:
 • name: String
 • age: Int
 • vehicle: Vehicle? — опціональний, бо не кожен має транспорт
 • experience: Int — стаж у роках
 2. Створи масив із 10–15 водіїв (кілька без транспорту, кілька з авто і мотоциклами).
 3. Завдання:
 • Відфільтрувати всіх водіїв, у яких є транспорт, і надрукувати їх у консоль
 • Відсортувати водіїв за стажем (experience), від найдосвідченішого до найнедосвідченнішого і роздрукувати
 • Відсортувати за віком від наймолодщого до найстаршого і роздрукувати
 4. Створи функцію:
func assignVehicle(to driver: Driver, from availableVehicles: inout [Vehicle]) -> Driver
яка:
 • перевіряє, чи у водія вже є транспорт
 • якщо немає — бере перший доступний Vehicle з масиву,
призначає його водієві та видаляє з пулу доступних
 • повертає оновленого водія
 5. Використай цю функцію для призначення транспорту всім водіям, у яких vehicle == nil.
 • Наприкінці виведи оновлений список усіх водіїв і їх транспортів.
 • Якщо транспорту не вистачило — виведи скільки людей залишилось без нього.
 6. Додай до Driver метод driveRandomly(), який:
 • генерує випадкову кількість кілометрів (наприклад, Double.random(in: 10...300))
 • якщо є транспорт — викликає drive(kilometers:) у нього
 • якщо немає — друкує “(name) тупцює ніжками, бо транспорту нема”
 7. Використай forEach, щоб кожен водій “зробив поїздку”.
 8. Додай private до тих властивостей і методів, які не потрібно бачити зовні.
Наприклад, зроби mileage у транспортних засобах приватним,
а публічний геттер (computed property) mileageInfo, який друкує пробіг у читабельному форматі.

Задачка з зірочкою:
 ⁃ Зробити реалізацію алгоритмів сортування із книги але на Swift (наскільки памʼятаю, там вже є реалізації, але буде класно хоча б "переписати", щоб краще запамятати)
 ⁃ бульбашкою
 ⁃ quick sort
 ⁃ merge sort
*/

// print("\n\n") - відступ у терміналі

class ViewLesson4 {
	static let shared = ViewLesson4()
	
	func start() {
		
	}
}
